cd 'D:\litor\Documents\Visual Studio 2017\Projects\Size\Size\bin\Release'

function test($x, $y, $w, $h){
    .\Size.exe EmEditor $((1920-640)/2) $((1040-480)/2) 640 480
    sleep 2

    .\Size.exe -a EmEditor $x $y $w $h
    sleep 2

    .\Size.exe -l | ? { $_ -like '*EmEditor*' }
}

# 以下の実行コードは、Excel から指定する値を貼り付けて、
# (\S+)\t(\S+)\t(\S+)\t(\S+) を
# test($1, $2, $3, $4) に置換すれば速い。

# サブディスプレイが無いとき
#test(-100, 100, 1000, 500)
#test(100, -100, 1000, 500)
#test(1020, 100, 1000, 500)
#test(100, 680, 1000, 500)
#test(100, 100, 2020, 500)
#test(100, 100, 1000, 1180)
#test(-100, 100, 1970, 500)
#test(100, 50, 1000, 1180)
#test(-100, -100, 2120, 1280)

# サブディスプレイが左にあるとき
#test(-1920, 100, 1000, 500)
#test(100, 0, 1000, 500)
#test(920, 100, 1000, 500)
#test(100, 580, 1000, 500)
#test(0, 100, 3840, 500)
#test(100, 0, 1000, 1080)
#test(-1920, 100, 3840, 500)
#test(100, 0, 1000, 1080)
#test(-1920, 0, 3840, 1080)

# サブディスプレイが下にあるとき
test(-100, 100, 1000, 500)
test(100, -100, 1000, 500)
test(1020, 100, 1000, 500)
test(100, 1760, 1000, 500)
test(100, 100, 2020, 500)
test(100, 100, 1000, 2260)
test(-100, 100, 1970, 500)
test(100, 50, 1000, 2260)
test(-100, -100, 2120, 2360)
